{
	"category": "freelance",
	"items": [
		{
			"title": "Opus Logica",
			"key": "opuslogica",
			"tags": "JavaScript, WebGL, React, Angular, Ruby on Rails",
			"description": "Retainer of freelance work for a few projects. Helped maintain OpusWorldWind project, an extension of 3D WebGL methods for the Nasa WorldWind library, for working with 3D objects on a map - <a href=\"https://github.com/opuslogica/OpusWorldWind\">https://github.com/opuslogica/OpusWorldWind</a>. Also worked on a Ruby on Rails admin application for an iOS/Ionic app, to manage the data and reporting for the application that is helping Crohn’s patients work with IoT data from devices.",
			"url":  "https://opuslogica.com",
			"thumb": "opus_thumb.png",
			"date_added": "9/24/2020"
		},	
		{
			"title": "One Night",
			"key": "onenight",
			"tags": "React, Laravel, iOS, responsive",
			"description": "Full stack developer for a Laravel backend, React web client, and some iOS revisions, on a remote team of 5 people. Primarily doing refactoring, bug fixes, and new feature implementation, utilizing CircleCI, PHPUnit testing, Google DialogFlow/chatbot, Rollbar logging, Synxis/booking API syncing.",
			"url":  "https://onenight.com",
			"thumb": "onenight_thumb.png",
			"date_added": "11/20/2019"
		},	
		{
			"title": "KK & Jay",
			"key": "kkandjay",
			"tags": "React, node.js, Shopify, HTML5, CSS3, responsive",
			"description": "Sole developer for fully responsive e-commerce React site with Express and Shopify backend.",
			"url":  "http://kkandjay.com",
			"thumb": "kkandjay_thumb.png",
			"date_added": "1/14/2018"
		},
		{
			"title": "Ripe",
			"key": "ripe",
			"tags": "HTML5, CSS3, node.js, responsive",
			"description": "Created an entirely new responsive, custom front end, and made modifications to the backend (node.js) to facilitate the management of the client job position/interview creation process, and also an end-user/job applicant process to submit video responses to the created interviews. All data is stored on AWS. Dev tool stack includes usage of ansible for automated packaging and deployment to S3, using DynamoDB for data storage.",
			"url":  "http://ripereference.com",
			"thumb": "ripe_thumb.png",
			"date_added": "7/4/2017"
		},
		{
			"title": "Shackshare",
			"key": "shackshare",
			"tags": "HTML5, CSS3, Laravel, responsive",
			"description": "Helped to create this custom Laravel application which serves as a sort of Airbnb for college students. I took over as lead developer and built the new responsive homepage, and am responsible for both the frontend and backend tasks.",
			"url":  "http://shackshare.com",
			"thumb": "shackshare_thumb.png",
			"date_added": "6/20/2017"
		},
		{
			"title": "Kitmoda",
			"key": "kitmoda",
			"tags": "HTML5, CSS3, Laravel, responsive",
			"description": "Created a completely responsive mosaic gallery in javascript that supports 1x1, 1x2, 2x1, and 2x2 grid elements that animate position according to window size in an organic way. The algorithm can take any arbitrary images and detect their optimal size ratios depending on their width and height. For a demo (currently without nice images as the original server is down), please see: https://codepen.io/rw3iss/pen/VpORWQ ",
			"url":  "http://kitmoda.com",
			"thumb": "kitmoda_thumb.png",
			"date_added": "6/1/2017"
		},
		{
			"title": "Fabworx Custom Fabrication",
			"key": "fabworx",
			"tags": "HTML5, CSS3, Wordpress, PHP, responsive, ecommerce, Paypal",
			"description": "Lead designer and developer for a simple Wordpress-based products and services site for custom fabricated car parts.",
			"url":  "http://fabworx.org",
			"thumb": "fabworx_thumb.png",
			"date_added": "9/10/2016"
		},
		{
			"title": "Shindig",
			"key": "shindig",
			"tags": "HTML5, CSS3, Wordpress, PHP, responsive",
			"description": "Fully responsive WordPress site showcasing case studies with media, a blog, and upcoming events. Functioned as lead developer for both the frontend and backend for a full frontend rebuild, and some minor backend refactoring to serve event, case study, and blog posts to the application.",
			"url": "http://shindig.com",
			"thumb": "shindig_thumb.png",
			"date_added": "8/27/2016"
		},
		{
			"title": "Revolve Robotics",
			"key": "revolve",
			"tags": "HTML5, CSS3, Wordpress, PHP, responsive",
			"description": "WordPress site where I designed and built a responsive homepage and landing pages. It utilizes lazy-loading of background videos and animation, uses HTML5 video with custom player controls, and is 100% responsive. I also developed a vanilla JS plugin called BackgroundCover that would allow me to keep an arbitrary piece of content (div, image, video, iframe) as a background that would always ensure it covers the entire width and height of the container, while maintaining original aspect ratio: https://github.com/rw3iss/BackgroundCover",
			"url": "https://revolverobotics.com",
			"thumb": "revolve_thumb.png",
			"date_added": "8/12/2016"
		},
		{
			"title": "Tuebora",
			"key": "tuebora",
			"tags": "HTML5, CSS3, responsive",
			"description": "Helped design and implement new responsive landing pages for a suite of various user access management products.",
			"url": "http://tuebora.com",
			"thumb": "tuebora_thumb.png",
			"date_added": "8/1/2016"
		},
		{
			"title": "Rowan University",
			"key": "rowan",
			"tags": "Drupal, PHP",
			"description": "Integrated the SimpleSAMLphp module with a Drupal backend to communicate SSO/single-sign-on with a Canvas LMS (learning management system) remote service provider. Ongoing maintenance of Drupal system and integration of new solutions and projects for the school.",
			"url": "http://rowan.edu",
			"thumb": "rowan_thumb.png",
			"date_added": "11/14/2015"
		},
		{
			"title": "Internet.org",
			"key": "internet",
			"tags": "HTML5, CSS3, Laravel, Amazon AWS, EC2, CloudFront, Bootstrap",
			"description": "Lead PHP developer for a Facebook campaign helping to bring internet to the rest of the world. I was responsible for making the site multilingual. Site is built on Laravel 4 utilizing Amazon S3 web services. I built a custom plugin to manage the localization from the remote Amazon S3 repository, caching locally. I also built a custom CMS in Bootstrap to manage and update the available language files for each supported locale. Utilizing composer, grunt and bower as build tools.",
			"url": "https://internet.org",
			"thumb": "internet_thumb.png",
			"date_added": "3/21/2015"
		},
		{
			"title": "YiHa",
			"key": "yiha",
			"tags": "HTML5, CSS3, Wordpress, responsive",
			"description": "Startup site for beta application signup and publicity. Mailchimp integration for subscription list. Kickofflabs.com integration for support. Backend in Wordpress with a service layer for storing signups in a MySQL database, and a small CMS so administrators can see those signups.",
			"url": "http://yiha.me",
			"thumb": "yiha_thumb.png",
			"date_added": "2/1/2015"
		},
		{
			"title": "DeCaro Trucking",
			"key": "decaro",
			"tags": "HTML5, CSS3, Angular.js, PHP, Bootstrap, responsive",
			"description": "Lead developer, architect, and designer for a local application that is written in PHP and services an Angular.js frontend which manages trucking orders and deliveries, and can be used to organize and create invoices as well as exported PDFs. The local application is cross-platform (built with PHP, served from a local server, wrapped in Qt/C++, using WebKit and pointing to the PHP site), which automatically syncs with a “master” application on the cloud (where clients can submit orders through), to maximize available redundancy.",
			"thumb": "decaro_thumb.png",
			"date_added": "11/1/2014"
		},
		{
			"title": "OldSpice Hairstimonials",
			"key": "oldspice",
			"tags": "Angular.js, Laravel, Amazon EC2, S3, RDS, Route53, CloudFront, PHP APC, Bootstrap",
			"description": "Lead backend developer and server administrator for a high-traffic (about 25k users a day) small video site. Responsibilities included working with Amazon EC2, S3, RDS, Route53, CloudFront serving of data, server optimization of Nginx and PHP APC. The backend was coded custom to be highly optimized, and includes a custom CMS (written in PHP,  Angular.js, and Bootstrap) for managing all video data and site configuration, with a reporting infrastructure and service interface to track how videos were being watched, with filtering and .csv export abilities. I also helped with some of the public frontend components.",
			"thumb": "oldspice_thumb.png",
			"date_added": "3/1/2014"
		},
		{
			"title": "True Renaissance",
			"key": "truerenaissance",
			"tags": "Wordpress, Paypal",
			"description": "Lead developer and server administrator for a Wordpress-based site dedicated to Renaissance artwork. Includes social integration with LinkedIn, Pinterest, and Facebook, and also custom PayPal payments.",
			"url": "http://truerenaissance.org",
			"thumb": "truerenaissance_thumb.png",
			"date_added": "1/1/2014"
		},
		{
			"title": "Cooper Union",
			"key": "cooper",
			"tags": "d3 charts",
			"description": "Frontend effort to create a virtual timeline of events with a searchable interface and custom navigation zoom box where you can hover to different sections of the timeline, with the ability to expand items. Data is pulled dynamically from a remote Google Docs API.",
			"url": "http://cooper.edu",
			"thumb": "cooper_thumb.png",
			"date_added": "10/1/2013"
		},
		{
			"title": "ESPN Fantasy Football Toolkit",
			"key": "espn",
			"tags": "ASP.NET, MySQL",
			"description": "Lead backend developer demonstrating competence in architectural principles for a high stream of users who use the toolkit to manage their fantasy leagues online, vote for drafting dates, and follow different 'grades' of player progress. Written in .NET and MySQL, in conjunction with two other frontend developers. Integration with ESPN's webservices and player data.",
			"url":  "http://games.espn.go.com/ffl/fantasyfootballtoolkit",
			"thumb": "espn_thumb.png",
			"date_added": "7/1/2013"
		},
		{
			"title": "Nabisco Party in Play",
			"key": "nabisco",
			"tags": "ASP.NET, responsive",
			"description": "Lead frontend and backend developer for a fully responsive superbowl party site made wth HTML5, jQuery, Modernizr, compatible to IE7. Small backend is coded in ASP.NET/C# and uses Nabisco webservices to retrieve recipes and display them in dynamic carousels and individual pages. Social integration with Facebook, Twitter and Pinterest.",
			"url":  "http://nabisco.stayhonest.com",
			"thumb": "nabisco_thumb.png",
			"date_added": "1/1/2013"
		},
		{
			"title": "AthletesTouch",
			"key": "athletestouch",
			"tags": "Wordpress, PHP, bbPress, GroupSpaces, Authorize.net, ecommerce, Paypal",
			"description": "Lead developer and server administrator for Wordpress-based athlete business meetup community. Includes Wordpress customization, responsive design elements for mobile and tablet, and also integration with third-party services such as Groupspaces, Authorize.net (defunkt), Paypal API, including implementation of SSL and custom subscription payments via API.",
			"url":  "http://athletestouch.com",
			"thumb": "athletestouch_thumb.png",
			"date_added": "1/1/2013"
		},
		{
			"title": "Riverbend Madison",
			"key": "riverbend",
			"tags": "Appfolio",
			"description": "Frontend developer for a simple website to showcase rental properties around areas of California.",
			"url":  "http://riverbendmadison.com",
			"thumb": "riverbend_thumb.png",
			"date_added": "1/1/2013"
		},
		{
			"title": "Wild Rhino Films",
			"key": "wildrhino",
			"tags": "Wordpress, PHP",
			"description": "Custom site developed and partially designed by myself, to display my brother’s documentarian film work.",
			"url":  "http://www.wildrhinofilms.com",
			"thumb": "wildrhino_thumb.png",
			"date_added": "12/1/2012"
		},
		{
			"title": "Hotmobile",
			"key": "hotmobile",
			"tags": "Wordpress",
			"description": "Hotmobile is social \"Pinterest for men\" for users to showcase and share media revolving around alluring subject matter.",
			"url":  "http://hotmobile.com",
			"thumb": "hotmobile_thumb.png",
			"date_added": "11/1/2012"
		},
		{
			"title": "Vitacare",
			"key": "vitacare",
			"tags": "backend, PHP, Drugstore",
			"description": "Implemented the shopping cart management backend with third-party API checkout from www.drugstore.com.",
			"url":  "http://www.vitacareworld.com",
			"thumb": "vitacare_thumb.png",
			"date_added": "9/1/2012"
		},
		{
			"title": "Ouidad",
			"key": "ouidad",
			"tags": "PHP, Facebook",
			"description": "Created three interactive Facebook pages where users can select custom beauty preferences and be referred to the main website, join in on content give-aways, and subscribe to a newsletter. Integration with the Facebook API to require that users like the page before being able to participate.",
			"url":  "http://www.ouidad.com",
			"thumb": "ouidad_thumb.png",
			"date_added": "7/1/2012"
		},
		{
			"title": "Finding Home",
			"key": "findinghome",
			"tags": "single page application",
			"description": "Lead designer and developer for a site showcasing photography, artwork, and stories related to the homeless around Atlantic City, NJ. Features “single-page” navigation, carousels, image galleries, and more.",
			"url":  "http://findinghome.ryanweiss.net",
			"thumb": "findinghome_thumb.png",
			"date_added": "6/1/2012"
		},
		{
			"title": "HulaFrog",
			"key": "hulafrgo",
			"tags": "ASP.NET",
			"description": "Helped to develop some modules for the application involving user event registration, and management of local events.",
			"url":  "http://hulafrog.com",
			"thumb": "hulafrog_thumb.png",
			"date_added": "4/1/2012"
		},
		{
			"title": "Nature's Boost",
			"key": "naturesboost",
			"tags": "PHP, Paypal",
			"description": "Lead designer and developer to display a single product geared towards all-natural energy increase. Includes online ordering through PayPal and contact abilities.",
			"url":  "http://naturesboostenergy.com",
			"thumb": "naturesboost_thumb.png",
			"date_added": "12/1/2011"
		}
	]
}